[
    {
        "id": 724,
        "title": "Network Infrastructure Cost Optimization",
        "problem_statement": "<h1>Network Infrastructure Cost Optimization</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>A cybersecurity consultant is helping an organization redesign their internal communication network after a recent security audit revealed compliance gaps. The auditors recommended restructuring the network topology to meet new industry standards for data classification and access control.</p>\r\n<p>The organization needs to optimize their network infrastructure costs while maintaining security compliance. The network consists of N+1 secure nodes labeled 0 through N, where node 0 serves as the primary security gateway.</p>\r\n<p>The current network architecture has two types of encrypted channels:</p>\r\n<ul>\r\n    <li><strong>Ring Channels:</strong> N peer-to-peer encrypted channel forming a circular communication ring where node i (for i = 1 to N) connects to node (i % N) + 1, each with decommissioning cost ring[i] credits</li>\r\n    <li><strong>Gateway Channels:</strong> N direct encrypted channels from the security gateway (node 0) to each operational node (1 &lt;= i &lt;= N), each with decommissioning cost gateway[i] credits</li>\r\n</ul>\r\n<p><strong>Cost Structure:</strong> When a channel is disabled for compliance, the organization incurs a one-time decommissioning cost (equipment removal, reconfiguration, security audits, etc.).</p>\r\n<p><strong>Security Compliance Requirement:</strong> Due to new regulations, the network must be restructured so that no nodes can be classified into exactly two security clearance levels (Level-Alpha and Level-Beta) such that no direct encrypted channel exists between nodes of the same security level.</p>\r\n<p>Your task is to determine the minimum total decommissioning cost of disabling encrypted channels to achieve a compliant network structure.</p>\r\n\r\n<h2>Input Format</h2>\r\n<ul>\r\n    <li>First line: N (number of operational nodes)</li>\r\n    <li>Second line: ring[1] ring[2]...ring[N] (decommissioning costs for ring channels in credits, where ring[i] is the cost to disable the channel from node i to node (i % N) + 1)</li>\r\n    <li>Third line: gateway[1] gateway[2]...gateway[N] (decommissioning costs for gateway channels in credits, where gateway[i] is the cost to disable the channel from node 0 to node i)</li>\r\n</ul>\r\n\r\n<h2>Output Format</h2>\r\n<p>Single integer; minimum total decommissioning cost in credits of channels that must be disabled to achieve compliance</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>3 &lt;= N &lt;= 2 * 10<sup>5</sup></li>\r\n    <li>1 &lt;= ring[i], gateway[i] &lt;= 10<sup>9</sup></li>\r\n</ul>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n3\r\n5 15 25\r\n10 20 30\r\nOutput:\r\n25</code></pre>\r\n<p><strong>Explanation:</strong> We have 3 operational nodes (1, 2, 3) plus the gateway (node 0). Ring costs are [5, 15, 25] and gateway costs are [10, 20, 30].</p>\r\n<p>To make the network compliant:</p>\r\n<ul>\r\n    <li><strong>Option 1:</strong> Remove all ring channels -&gt; Cost: 5+15+25 = 45</li>\r\n    <li><strong>Option 2:</strong> Remove channel 0-1 and 2-3 -&gt; Cost: 10+15 = 25 ✓</li>\r\n    <li><strong>Option 3:</strong> Remove channel 0-3 and 1-2 -&gt; Cost: 30+5 = 35</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Eqifax_23july",
        "company_id": 228
    }
]