[
    {
        "id": 966,
        "title": "Energy Transfer in Battle of the Band",
        "problem_statement": "<h1>Energy Transfer in Battle of the Band</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Murat and Hayat are playing an online game \"Battle of the Band\" with their respective armies. Each soldier in their armies has some energy levels. In the middle of the game, Hayat's army gets weak and they need help from Murat's army. Murat's army doesn't have the power to help them but Murat has a special power with which he can increase the power of his soldiers by transferring the energy of the soldiers within the army. Transferring of energy can happen between the soldiers who are standing at S distance from each other. If the sum of the energies of all the soldiers who are at S distance(Se) from each other can be expressed as sum of K (K is the number of soldiers who take part in sharing) prime numbers, then all the soldiers of both the armies with distinct energies and one among the two soldiers with the same energy in both the armies can win the battle. If Se cannot be expressed as the sum of K prime numbers then only the soldiers with the same energies in both the armies can stay alive till they win the battle.</p>\r\n<p>With this power, Murat can help Hayat. The winning army should have only one member of the soldiers with the same energy levels. Currently, Hayat's army has seven soldiers with energy level 2 7 200 19 50 13 33.</p>\r\n<p>You have been given the number of soldiers (N), the distance at which they can transfer the energy (S) and the current energy levels of Murat's army as inputs. Display the energy of both the armies (in ascending order of their energy) to denote who stays till the end of the game.</p>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not print arbitrary strings anywhere in the program, as these contribute to the output and test cases will fail.</p>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first line of the input contains S and N separated by a single white space.<br>The second line of the input contains N integers separated by a single white space.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>The output will be the soldier's energy level in ascending order, each separated by a single white space.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>Input numbers > 0</li>\r\n    <li>S &lt; N</li>\r\n</ul>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n2 5\r\n4 8 6 5 2\r\nOutput:\r\n2 4 5 6 7 8 13 19 33 50 200</code></pre>\r\n<p><strong>Explanation:</strong> Here S=2, and N=5.<br>Murat's 5 soldiers with energy level 4 8 6 5 2.<br>Hayat's 7 soldiers with energy level 2 7 200 19 50 13 33.<br>Energy sharing can be done between 4,6 and 2 so K=3 and Se= 12<br>4+6+2= 12<br>which can be expressed using 3 prime numbers as 2+5+5<br>Energy sharing can be done between 8 and 5 So K=2 and Se= 8+5= 13<br>which can be expressed using 2 prime numbers as 11+2 so energy is retained.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n4 7\r\n5 8 6 13 2 3 8\r\nOutput:\r\n2 13</code></pre>\r\n<p><strong>Explanation:</strong> Here S=4, and N=7.<br>Murat's 7 soldiers with energy level 5 8 6 13 2 3 8.<br>Hayat's 7 soldiers with energy level 2 7 200 19 50 13 33.<br>Energy sharing can be done between 5 and 2 so K=2 and Se= 5+2 = 7<br>which can be expressed using 2 prime numbers like 2 + 5<br>Energy sharing can be done between 8 and 3 So K=2 and Se= 8+3 = 11<br>which cannot be expressed using 2 prime numbers hence soldiers with common energies in both the armies will survive till the end of the war that is 2 and 13 hence printed in ascending order of their energies.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Flipkart_26july",
        "company_id": 309
    }
]