[
    {
        "id": 1024,
        "title": "Count Non-Common Elements in Two Lists",
        "problem_statement": "<h1>Count Non-Common Elements in Two Lists</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>You are given two lists of different lengths of positive integers. Write an algorithm to count the number of elements that are not common to each list.</p>\r\n\r\n<h2>Input</h2>\r\n<p>The first line of the input consists of an integer - <code>listInput1_size</code>, an integer representing the number of elements in the first list (N).</p>\r\n<p>The second line consists of N space-separated integers representing the first list of positive integers.</p>\r\n<p>The third line consists of an integer - <code>listInput2_size</code>, representing the number of elements in the second list (M).</p>\r\n<p>The last line consists of M space-separated integers representing the second list of positive integers.</p>\r\n\r\n<h2>Output</h2>\r\n<p>Print a positive integer representing the count of elements that are not common to both the lists of integers.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n11\r\n1 1 2 3 4 5 6 7 9 10\r\n10\r\n11 12 13 4 5 6 7 18 19 20\r\nOutput:\r\n12</code></pre>\r\n<p><strong>Explanation:</strong> The numbers that are not common to both lists are [1, 1, 2, 3, 9, 10, 11, 12, 13, 18, 19, 20]. So, the output is 12.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Barclays_27july",
        "company_id": 332
    },
    {
        "id": 1025,
        "title": "Reactor Energy Maximization",
        "problem_statement": "<h1>Reactor Energy Maximization</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Dr. Victor Frankenstein has quit the monster creation business. Nuclear energy now strikes his fantasy. He has created a fission reactor that takes radioactive materials in a liquid state. The capacity of the reactor is 'Y' gallons. He has 'N' vials of radioactive liquids, each with some mass and some volume. Some units of energy are produced when a liquid is poured into the reactor. Victor would like to maximize the energy output. However, there is a catch. Upon studying the chemical property of atomic elements, he came to know that the combined mass of the radioactive liquids inside the reactor must not exceed a certain criticalMass. Moreover the reaction would go out of control and cause a violent explosion. Write an algorithm that will help Victor get the maximum energy from the reactor without losing his life.</p>\r\n\r\n<h2>Input</h2>\r\n<p>The first line consists of an integer <code>maxCapacity</code>, representing the reactor capacity (Y).</p>\r\n<p>The second line consists of an integer <code>criticalMass</code>, representing the critical mass of the reactor (M).</p>\r\n<p>The third line consists of an integer <code>numVolumes</code>, representing the number of source volumes (N).</p>\r\n<p>The fourth line consists of <code>N</code> space-separated integers, <code>vol[0], vol[1]...vol[N-1]</code> representing the volumes of <code>N</code> liquids in order.</p>\r\n<p>The fifth line consists of an integer <code>numMasses</code>, representing the number of masses (N).</p>\r\n<p>The sixth line consists of <code>N</code> space-separated integers, <code>mass[0], mass[1]...mass[N-1]</code> representing the masses of <code>N</code> liquids in order.</p>\r\n<p>The seventh line consists of an integer <code>numEnergy</code>, representing the number of energies (N).</p>\r\n<p>The last line consists of <code>N</code> space-separated integers, <code>energy[0], energy[1]...energy[N-1]</code> representing the energy produced by <code>N</code> liquids in order.</p>\r\n\r\n<h2>Output</h2>\r\n<p>Print an integer which is the maximum energy that can be generated from the reactor in the given constraints.</p>\r\n\r\n<h2>Note</h2>\r\n<p><code>numVolumes</code>, <code>numMasses</code>, <code>numEnergy</code> are same.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li><code>1 &lt;= numVolumes, numMasses, numEnergy &lt;= 10<sup>4</sup></code></li>\r\n</ul>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n100\r\n15\r\n5\r\n50 40 30 20 10\r\n5\r\n1 2 3 9 5\r\n5\r\n300 480 270 200 180\r\nOutput:\r\n960</code></pre>\r\n<p><strong>Explanation:</strong> By selecting liquids from vials number-1, 2, 5, the energy produced is 300+480+180=960. This combination of liquid contributed to the total volume = 50+40+10=100, which is not greater than reactorCap; and contributed to the total mass in the reactor=1+2+5=8, which is not greater than criticalMass.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Barclays_27july",
        "company_id": 332
    }
]