[
    {
        "id": 1052,
        "title": "Maximize Amplifier Factor",
        "problem_statement": "<h1>Maximize Amplifier Factor</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Samsung Electronics has developed a signal amplifier with high efficiency by using semiconductor elements.</p>\r\n<p>The amplifier consists of N vertical elements, M horizontal elements, in total N x M elements.</p>\r\n<p>Each element will send a signal from left to right, if its status is 'Positive', but not if it's 'Negative'.</p>\r\n<p>This means that only if all elements in one row are 'Positive', the amplification factor will increase by one. (Signals cannot be transmitted up or down direction.)</p>\r\n<p>By making the degree of integration very high and the energy consumption low, it is difficult, in return, to make all elements 'Positive' due to process limitations.</p>\r\n<p>Signals are transmitted from left to right; The more rows there are with only 'Positive' elements, the higher increases the amplification factor.</p>\r\n<p>For instance in [Fig. 1-1] below, since the elements are all 'Positive' in one row, the amplification factor is 1. However, since two rows in [Fig. 1-2] are full of 'Positive' elements, the amplification factor is 2 in this case. (Yellow cells in the figure are 'Positive' elements. Gray cells are 'Negative' elements)</p>\r\n<p>To improve the amplification factor, a special laser can be used to reverse the element statuses.</p>\r\n<p>The laser can be, as shown in [Fig. 2], used for one column at a time and all of the elements belonging to the column will change their statuses. (Meaning, 'Positive' elements will change to 'Negative', 'Negative' elements will change to 'Positive')</p>\r\n<p>Due to process settings, the laser must be used K times and the number of times cannot be controlled (You MUST use the laser K times.)</p>\r\n<p>Laser can be used several times for the same column.</p>\r\n<p>Laser cannot be used outside of the amplifier.</p>\r\n<p>For instance, if the statuses of the amplifier elements are given as in [Fig. 3-1], the current amplification factor is 0, but when 5 is given as K (K=5), the maximum amplification factor that we can generate is 2. One of several possible ways to create the maximum amplification factor is the following.</p>\r\n<p>If the laser is used 1 time for the first column (C1), 1 time for the second column (C2), 2 times for the third column (C3) and 1 time for the fourth column (C4), it is possible to generate an amplification factor of 2 as shown in [Fig. 3-2].</p>\r\n<p>Given the statuses of the amplifier elements and the number of times to use the laser (K), write a program that maximizes the amplification factor.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>The vertical (N) size of the amplifier is 3 or greater, 100 or less (3 &le; N &le; 100), and horizontal (M) size of the amplifier are 3 or greater, 20 or less. (3 &le; M &le; 20)</li>\r\n    <li>The number of times to use the laser (K) is 1 or greater, M or less. (1 &le; K &le; M)</li>\r\n    <li>The laser MUST be used all K times.</li>\r\n    <li>The laser can be used several times for the same column.</li>\r\n    <li>Print '0', if the amplification factor is still 0 after using the laser K times.</li>\r\n    <li>It is possible that the amplification factor cannot be increased even after using the laser K times.</li>\r\n    <li>Each element sends signals from the left to the right direction only, but NOT to the directions up or down.</li>\r\n</ul>\r\n\r\n<h2>Input</h2>\r\n<p>In the first line, T, the number of total test cases is given.</p>\r\n<p>From the next line on, each test case is given.</p>\r\n<p>In the first line of each test case, the vertical (N) and horizontal (M) sizes of the amplifier and K, the number of times to use the laser, are given in order.</p>\r\n<p>In the next N lines, M element statuses are given in each line.</p>\r\n<p>If '1', the status of the element is 'Positive'. If '0', the status of the element is 'Negative'.</p>\r\n\r\n<h2>Output</h2>\r\n<p>Print '#T' for Test Case T and print the maximum amplification factor that can be generated by using the laser K times. (T stands for the Test Case number and starts with 1.)</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Input Example:</h3>\r\n<pre><code class='language-text'>5\r\n3 3 2\r\n0 1 0\r\n0 1 1\r\n0 0 0\r\n5 3 3\r\n0 1 0\r\n1 0 0\r\n0 1 0\r\n0 0 1\r\n1 0 0\r\n10 4 2\r\n0 1 0 0\r\n1 1 1 0\r\n1 1 1 1\r\n0 1 0 0\r\n1 1 1 1\r\n1 1 1 1\r\n1 1 1 1\r\n1 1 1 1\r\n1 1 1 0\r\n// For remaining test cases, refer to 'sample_input.txt'</code></pre>\r\n\r\n<h3>Correct Output for Input Example:</h3>\r\n<pre><code class='language-text'>#1 1\r\n#2 0\r\n#3 5\r\n#4 7\r\n#5 6</code></pre>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Samsung_29july",
        "company_id": 341
    }
]