[
    {
        "id": 1124,
        "title": "Tug of War",
        "problem_statement": "<h1>Tug of War</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>The game \"Tug of War\" is being played between opponents on one side wins by pulling the other side towards it completely. A lot of players have lined up to play the game. Every player is given a weight index Wi on the basis of their weight in the range of 3 to 9. The task of the organizers is to make the total weight index equal on both sides before the game starts, while making sure the maximum number of people can participate in the game.</p>\r\n<p><strong>Note:</strong></p>\r\n<ul>\r\n    <li>The people on each side should be picked consecutively.</li>\r\n    <li>Assume that solution do exist for all the testcases.</li>\r\n</ul>\r\n<p>Write a program to help the organizers by reading the input from STDIN and writing the output to STDOUT.</p>\r\n<p>Do not write arbitrary strings while reading the input and while printing as these contribute to the standard output.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>10 &gt; W &gt;= 0</li>\r\n    <li>The number of players after weight index equalization should be equal on both sides otherwise print \"0\" (without quotes).</li>\r\n</ul>\r\n\r\n<h2>Input Format</h2>\r\n<p>The input contains the weight index of all players in the game, in sequence.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>The first line of output would be total count of players who can finally play the game.</p>\r\n<p>The second line of output will be the list of players (in sequence) after weight index normalization.</p>\r\n\r\n<h2>Examples</h2>\r\n\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: 145664852\r\nOutput:\r\n6\r\n566485</code></pre>\r\n<p><strong>Explanation:</strong> Players with weight indices 1,4,5,6,6,4,8,5,2 have lined up to play the game - total 9 players. The weight index becomes equal on both sides when players with weight indices 1 and 4 on the left and 2 on the right leave the ground, because 5+6+6 = 4+8+5. Thus 6 players can play the game and the updated list of players' weight index is the output.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input: 732198327936\r\nOutput:\r\n12\r\n732198327936</code></pre>\r\n<p><strong>Explanation:</strong> All the 12 players can play the game here because the weight index is already equal on both sides i.e. 7+3+2+1+9+8+3+2+7+9+3+6.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Lam Research_7aug",
        "company_id": 372
    }
]