[
    {
        "id": 1125,
        "title": "Egg Distribution",
        "problem_statement": "<h1>Egg Distribution</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Fitness, an important effort to promote healthy eating, has allotted 1 tray of eggs each to N students. Each tray is filled with N eggs. Every student is allotted a random number each day, and all students with the same random number must form a group. All the students in that group must consume eggs that are equal to the group size. For example, if group size is 3 then all the students in that group must consume 3 eggs from their tray.</p>\r\n<p>The Principal wanted a dashboard which displays the number of eggs left in each student's tray. Can you help with a program that accepts the number of students N and the random numbers allotted to each student, and prints the number of eggs left in each tray?</p>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not write arbitrary strings anywhere in the program, as these contribute to the standard output and testcases will fail.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>Number of students, N > 0</li>\r\n</ul>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first line of input contains N, the total number of students.</p>\r\n<p>The second line of input contains N random numbers that are allotted to the students, separated by single white spaces.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>Single line of output should contain the number of eggs left in each tray, separated by single white spaces.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n8\r\n1 2 5 2 2 5 4 4\r\nOutput:\r\n7 5 6 5 5 6 6 6</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>The total number of students and total number of eggs in each tray, N=8.</p>\r\n<p>The random numbers allotted to students are 1, 2, 5, 2, 2, 5, 4, 4.</p>\r\n<p>There is only 1 student who is allotted the random number as 1, so he/she will consume only one egg, therefore left over eggs = 8-1 = 7.</p>\r\n<p>There are 3 students who are allotted the random number as 2, so they will consume three eggs, therefore left over eggs in their trays = 8-3 = 5.</p>\r\n<p>There are 2 students who are allotted the random number as 5, so they will consume two eggs, therefore left over eggs in their trays = 8-2 = 6.</p>\r\n<p>There are 2 students who are allotted the random number as 4, so they will consume two eggs, therefore left over eggs in their trays = 8-2 = 6.</p>\r\n<p>So the left over eggs in each tray will be 7 5 6 5 5 6 6 6.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n6\r\n15 16 19 22 45 75\r\nOutput:\r\n5 5 5 5 5 5</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>The total number of students and total number of eggs in each tray, N=6.</p>\r\n<p>The random numbers allotted by students are 15, 16, 19, 22, 45, 75.</p>\r\n<p>All the students are allotted unique numbers, therefore they are all in a group of 1.</p>\r\n<p>Each student therefore eats only 1 egg from their tray, so the left over eggs in the trays are 5 5 5 5 5 5.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Lam Research_7aug",
        "company_id": 373
    }
]