[
    {
        "id": 1143,
        "title": "Domino Pyramid",
        "problem_statement": "<h1>Domino Pyramid</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>John found six dominoes. A domino is a rectangular tile with a line dividing its face into two square halves. Each half is marked with a number of spots. John wants to build a three-stage pyramid from these dominoes. The first level should consist of three dominoes, the second level of two dominoes and the highest of one domino. The levels are arranged in such a way that the peak of the pyramid is at the center: that is, each level is positioned over the center of the level below it. There is also an additional condition. The number of spots on each domino half should be the same as the number of spots on the half positioned beneath it. Note that this does not apply to neighboring dominoes on the same level.</p>\r\n<p>Is it possible to build a pyramid from these dominoes, as described above? Dominoes can be freely rearranged. We also assume that dominoes can be rotated (that is, the piece [X, Y] can be treated as [X, Y] or [Y, X], where X denotes the number of spots in the first half-domino and Y denotes the number of spots in the second half-domino).</p>\r\n<p>Write a function:</p>\r\n<pre><code class='language-javascript'>string solution (vector&lt;int&gt; &amp;A);</code></pre>\r\n<p>that, given an array <strong>A</strong> consisting of twelve integers (the first and the second integer describe the first domino, the third and the fourth integer describe the second domino, etc.), returns the string \"YES\", if it is possible to build a correct pyramid from these dominoes or \"NO\" otherwise.</p>\r\n<p>In your solution, focus on correctness. The performance of your solution will not be the focus of the assessment.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: A = [4, 3, 3, 4, 1, 2, 2, 3, 6, 5, 4, 5]\r\nOutput: YES</code></pre>\r\n<p><strong>Explanation:</strong> John found the following dominoes: [4, 3], [3, 4], [1, 2], [2, 3], [6, 5], [4, 5]. There are several ways to build the pyramid. For instance, John can rotate first and fifth domino and as a result gets: [3, 4], [3, 4], [1, 2], [2, 3], [5, 6], [4, 5]. Next, he can place the third, the first and the fifth domino at the first level (in this order), the fourth and the sixth domino at the second level (also in this order) and the second domino at the highest level. The result will be:</p>\r\n<p><img src=\"domino_pyramid_example.png\" alt=\"Domino Pyramid Example\"></p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>array <strong>A</strong> contains twelve integers;</li>\r\n    <li>each element of array <strong>A</strong> is an integer within the range [1..12].</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Amex_7aug",
        "company_id": 384
    }
]