[
    {
        "id": 1295,
        "title": "Soil Level Difference",
        "problem_statement": "<h1>Soil Level Difference</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not print arbitrary strings anywhere in the program, as these interfere with the standard output and test cases will fail.</p>\r\n<p>Diego bought a square shape plot to build his new house. He wanted to build his house in such a way that all the sides of his house are garden fences and an equal amount of area is provided to each garden. So, he built a square shape structure inside the plot to create his house, and left the rest to be used for the garden. He built a fence to separate the house area from the garden areas.</p>\r\n<p>Later he realised that the plot was quite uneven and to level it, he would need to move some soil from one area to the other. He mapped the plot in the form of a matrix and determined the height of soil in each cell, ignoring the cells where the fence was already built. Help him determine how much soil he needs to move, by writing a program to calculate the absolute difference of soil levels between the inner and outer plots.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li><code>3 &lt;= n &lt;= 100</code> (n is always odd number)</li>\r\n    <li><code>-100 &lt;= arr[i][j] &lt;= 100</code> (where a -ve number represents a lack of soil, and +ve represents excess amount of soil)</li>\r\n</ul>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first line of input consists of an integer n, which determines the size of the square matrix representing the plot.</p>\r\n<p>The next n lines consist of n-space separated integers representing the soil level in each cell, (one row in one line).</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>Single line of output consists of the absolute difference in soil levels of inner and outer plots.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n3\r\n1 2 3\r\n4 5 6\r\n7 8 9\r\nOutput:\r\n15</code></pre>\r\n<p><strong>Explanation:</strong> Given a plot of size 3 x 3.</p>\r\n<p>(Diagram of 3x3 grid with numbers 1-9, and 'X's on cells 2,4,6,8)</p>\r\n<p>The cells with values 2,4,6,8 have the fence.</p>\r\n<p>The inner plot has extra soil 5</p>\r\n<p>The outer plots have extra soil = 1+3+7+9 = 20</p>\r\n<p>Absolute difference is 15.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n5\r\n-1 2 0\r\n3 -3 1\r\n2 4 3 1\r\n2 3 2 3 1\r\n-1 -2 3 4 5\r\nOutput:\r\n9</code></pre>\r\n<p><strong>Explanation:</strong> Plot size is 5 x 5. The cells with the fence are shown in the diagram below.</p>\r\n<p>(Diagram of 5x5 grid with numbers and 'X' marks)</p>\r\n<p>Extra soil in the inner plot is -3+4+3+1+2 = 7.</p>\r\n<p>Extra soil in the outer plot is -1+2+0+3+1+2+0+3+1+2+1-2+4+5 = 9.</p>\r\n<p>Absolute difference is 9.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "flipkart_20aug",
        "company_id": 446
    },
    {
        "id": 1296,
        "title": "Second Most Impactful People",
        "problem_statement": "<h1>Second Most Impactful People</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Sam, who is a Businessman in the garments industry came up with an idea to start his own Business over the Internet by E-commerce. To promote and advertise his product he decided to hire Social Media Models, so he asked to all the popular Models and created a graph of their Network. He required highly impactfull persons to be part of brand and the list of <strong>second most impactfull</strong> to run social media campaigns and product promotions.</p>\r\n<ul>\r\n    <li><strong>Impactfull person:</strong> A person who is having more followings</li>\r\n    <li><strong>Highly Impactfull person:</strong> A person who is having more following as well as having more impactfull people in his connection.</li>\r\n    <li><strong>Second most impactfull person:</strong> The second most impactfull person comes right after the highly impactfull person.</li>\r\n</ul>\r\n<p>Now help sam to identify, the second most impactfull person, who can run social media campaigns and run product promotions.</p>\r\n<p>With a program, that process the graph and print the names of second most impactfull person in ascending order according to node number.</p>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not write arbitrary strings anywhere in the program, as these contribute to the standard output and test cases will fail.</p>\r\n\r\n<h2>Input Format</h2>\r\n<p>First line consists of an integer N, determines the number of nodes.</p>\r\n<p>Each of the next N lines has N space-separated integers, determining if a path exists between any two nodes.</p>\r\n<p>Next N lines consists of Strings of N names, in order of nodes.</p>\r\n<p><strong>Note:</strong> 1 if a path exists between node A (A=row number) and node B (B=column number), 0 if not.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>In each line, k number of names according to nodes printed in ascending order. Where k is number of second most impactfull nodes.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li><code>2 <= n <= 150</code></li>\r\n    <li><code>0 <= arr[n][n] <= 1</code></li>\r\n    <li><code>names[n]</code></li>\r\n</ul>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n5\r\n01110\r\n10011\r\n10011\r\n11001\r\n01100\r\nOlivia\r\nEmma\r\nAva\r\nSophia\r\nIsabella.\r\nOutput:\r\nEmma\r\nAva</code></pre>\r\n<p><strong>Explanation:</strong> From the Given Data, the following Graph is been Generated.</p>\r\n<p>In the following Graph,</p>\r\n<p>Node 0 which equivalent name is Olivia and for 3 equivalent name is Sophia are the most impactfull Node.</p>\r\n<p>Node 1, 2 has the higher number of Connection to other nodes (Higher Degree).</p>\r\n<p>Node 4 is the least impactfull Node.</p>\r\n<p>Hence Node 1 and 2 is second most impactfull.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n9\r\n011000000\r\n101000010\r\n110100100\r\n001010000\r\n000101100\r\n000010011\r\n00000101\r\n010000101\r\n000001100\r\nAmelia\r\nMia\r\nHarper\r\nEvelyn\r\nAbigail\r\nEmily\r\nElla\r\nElizabeth\r\nCamila\r\nOutput:\r\nHarper\r\nEvelyn</code></pre>\r\n<p><strong>Explanation:</strong> From the Given Data, the following Graph is been Generated.</p>\r\n<p>In the following Graph,</p>\r\n<p>Node 6 which equivalent name is Ella is the most impactfull person.</p>\r\n<p>Node 2 and 3 equivalent name Harper and Evelyn is the second most impactfull person. (i.e 6 is connected with 2,3,7,8 whereas Nodes 2 and 3 is connected to least popular nod)</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "flipkart_20aug",
        "company_id": 446
    },
    {
        "id": 1297,
        "title": "Most Frequent N-gram",
        "problem_statement": "<h1>Most Frequent N-gram</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>The term N-gram refers to all possible substrings of length N and formed using consecutive letters contained in a string. Given a string S and an integer N, find the most frequent N-gram in the number of times it appears in S. If there is more than one N-gram with the same frequency, output the first one that appears in S. Read the input from STDIN and print the output to STDOUT. Do not write arbitrary strings anywhere in the program, as these contribute to the standard output and test cases will fail.</p>\r\n\r\n<h2>Input Format</h2>\r\n<p>A single line of input contains S and N separated by a single white space.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>The output contains a string denoting the most frequent N-gram and an integer denoting the number of times the N-gram appears in S, separated by a single white space.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: banana 3\r\nOutput: ana 2</code></pre>\r\n<p><strong>Explanation:</strong> The string S is 'banana' and the N = 3. All the N-grams and their associated frequency are:</p>\r\n<pre><code class='language-text'>ban 1\r\nana 2\r\nnan 1</code></pre>\r\n<p>The most frequent N-gram is: 'ana' and its frequency is: 2. Hence the output is ana 2.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input: isamohanahismohana 3\r\nOutput: moh 2</code></pre>\r\n<p><strong>Explanation:</strong> S = 'isamohanahismohana'. N=3. The N-grams and their frequencies are given below.</p>\r\n<pre><code class='language-text'>isa-1\r\nsam-1\r\namo-1\r\nmoh-2\r\noha-2\r\nhan-2\r\nana-2\r\nnai-1\r\nais-1\r\nism-1\r\nsmo-1</code></pre>\r\n<p>We can see that there are multiple N-grams with the same frequency. In such cases, the output would be the first N-gram that appears in S. Here the first N-gram with the highest frequency is moh and it appears twice in S. Hence the output is moh 2.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n<li>1 &lt;= |S| &lt;= 100</li>\r\n<li>1 &lt;= N &lt;= 10</li>\r\n<li>N &lt;= |S|</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "flipkart_20aug",
        "company_id": 446
    }
]