[
    {
        "id": 1384,
        "title": "Wind Turbine Placement",
        "problem_statement": "<h1>Wind Turbine Placement</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>The effects of global warming can be seen more and more each year. That is why many countries aim to reduce greenhouse gases by creating electricity from the wind instead of from fossil fuels. Wind turbines have fewer negative effects on the environment and create less carbon dioxide.</p>\r\n<p>A company has a contract to build a wind farm on a rectangular area of land. The goal is to build as many turbines as possible, to make the wind farm's power capacity as high as possible.</p>\r\n<p>It was recently discovered that an endangered species of bird lives on the land. The area where these birds live is called a \"habitat\". The company wants to build the wind turbines at a distance greater than K from every bird habitat.</p>\r\n<p>The map of the land is given as a rectangular matrix A of integers. Bird habitats are represented as 1 and all other locations are represented as 0.</p>\r\n<p>A turbine will fill exactly one cell of the map and each cell can have at most one turbine. The distance between two locations is equal to the sum of horizontal and vertical differences between two cells on the map. For example, the distance between cells A[3][2] and A[1][4] is |3-1| + |4-2| = 4.</p>\r\n<p>Write a function:</p>\r\n<pre><code class='language-javascript'>int solution(vector&lt;vector&lt;int&gt;&gt; &amp;A, int K);</code></pre>\r\n<p>that, given a matrix A consisting of N rows and M columns and an integer K, returns the maximum number of wind turbines that can be built while staying more than K distance from the birds.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: A (4x3 matrix), K = 1\r\nHabitats at: (0,0), (2,2), (3,1)\r\nOutput: 3</code></pre>\r\n<p><strong>Explanation:</strong> The matrix A is 4x3. Bird habitats are at (0,0), (2,2), and (3,1). Wind turbines can be built at (0,2), (1,1), and (2,0). These locations are more than K=1 distance away from all habitats. The grid below shows 'X' for habitat and 'T' for a valid turbine location:</p>\r\n<pre><code class='language-text'>  0 1 2\r\n0 X . T\r\n1 . T .\r\n2 T . X\r\n3 . X .</code></pre>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input: A (3x4 matrix), K = 2\r\nNo habitats\r\nOutput: 12</code></pre>\r\n<p><strong>Explanation:</strong> The matrix A is 3x4. Since there are no bird habitats and K=2, wind turbines can be built in every location. The grid below shows 'T' for a valid turbine location:</p>\r\n<pre><code class='language-text'>  0 1 2 3\r\n0 T T T T\r\n1 T T T T\r\n2 T T T T</code></pre>\r\n\r\n<h3>Example 3:</h3>\r\n<pre><code class='language-text'>Input: A (8x8 matrix), K = 2\r\nHabitats at: (2,2), (6,6)\r\nOutput: 40</code></pre>\r\n<p><strong>Explanation:</strong> The matrix A is 8x8. Bird habitats are at (2,2) and (6,6). Cells that are within a distance of K=2 (inclusive) from any habitat are considered too close. The function should return 40, representing the number of cells where wind turbines can be safely built (i.e., cells that are not too close to bird habitats).</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li><code>N</code> and <code>M</code> are integers within the range <code>[1..750]</code>.</li>\r\n    <li><code>K</code> is an integer within the range <code>[1..1500]</code>.</li>\r\n    <li>Each element of matrix <code>A</code> is an integer that can have one of the following values: <code>0, 1</code>.</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "cockroach labs_6sep",
        "company_id": 482
    }
]