[
    {
        "id": 1567,
        "title": "Maximum Security Clearance",
        "problem_statement": "<h1>Maximum Security Clearance</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>You're a cybersecurity engineer at a top-tier firm, tasked with a critical component of a new distributed secure encryption system. In this system, the data is stored at different security levels, represented as an m-bit integer. For certain high-privilege operations, such a full system-wide backup restoration, a process needs to acquire a 'Maximum Security Clearance'. This clearance is achieved when the bitwise OR of the security levels of a consecutive sequence of data chunks equals 2<sup>m</sup> - 1 (a bitmask with all m bits set to 1).</p>\r\n<p>Your mission is to develop an efficient algorithm to identify the shortest possible continuous sequence of data chunks that collectively grant the Maximum Security Clearance.</p>\r\n\r\n<h2>Input Format</h2>\r\n<ul>\r\n    <li>Each input contains multiple test cases. The first line contains a single integer t indicating the number of test cases.</li>\r\n    <li>The first line of each test case contains two space-separated integers, n and m, where n is the total number of data chunks and m is the number of bits representing the security level.</li>\r\n    <li>The second line of each test case contains n space-separated integers, a<sub>1</sub>, a<sub>2</sub>, ..., a<sub>n</sub>, where a<sub>i</sub> is the security level of the i-th data chunk.</li>\r\n</ul>\r\n\r\n<h2>Output Format</h2>\r\n<ul>\r\n    <li>For each test case, output a single integer representing the length of the shortest consecutive sequence of data chunks whose combined bitwise OR results in 2<sup>m</sup> - 1.</li>\r\n    <li>If no such sequence exists, output -1.</li>\r\n</ul>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>t &lt;= 10<sup>4</sup></li>\r\n    <li>1 &lt;= n &lt;= 10<sup>5</sup></li>\r\n    <li>1 &lt;= m &lt;= 20</li>\r\n    <li>0 &lt;= a<sub>i</sub> &lt;= 2<sup>m</sup> - 1</li>\r\n    <li>The sum of n over all test cases does not exceed 5 * 10<sup>5</sup></li>\r\n</ul>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n1\r\n3 3\r\n1 2 4\r\nOutput:\r\n3</code></pre>\r\n<p><strong>Explanation:</strong> We need to get the max possible security level of (2<sup>3</sup> - 1) = 7 (which has all 1's in its binary representation). This can be achieved by using the consecutive elements of (1,2,4) as the bitwise OR of 1 (001 in binary), 2 (010 in binary) and 4 (100) in binary achieves the value of 7, and this is not achievable by any of the other shorter subsequences of the given array.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n2\r\n5 4\r\n12 2 13 4 5\r\n5 5\r\n1 2 8 5 2\r\nOutput:\r\n2\r\n-1</code></pre>\r\n<p><strong>Explanation:</strong> In the first testcase, the max possible security level of 15 (2<sup>4</sup> - 1) can be obtained by taking continuous elements 2 and 13, whose bitwise OR evaluates to 15.</p>\r\n<p>In the second test case, none of the continuous subsequences of the given array have bitwise ORs evaluate to 2<sup>5</sup>-1 = 31. As no continuous data chunks can give us the maximum security level, we report -1 as the answer.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "rubrik_4oct",
        "company_id": 552
    }
]