[
    {
        "id": 1656,
        "title": "Pass The Ball",
        "problem_statement": "<h1>Pass The Ball</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Assume that a group of N players are playing a game. In this game, a player must pass the ball to another player. A player P holds the ball at the beginning of the game. A maximum of X moves are allowed while passing the ball such that it ends up with the same player who started the game. Given below is the condition that must be followed by all the players while passing the ball:</p>\r\n<ul>\r\n    <li>A player K1 can pass the ball to another player K2 if K1 divides K2 or K2 divides K1.</li>\r\n</ul>\r\n<p>Your task is to find and return an integer value representing the number of possible ways to complete the game.</p>\r\n<p><strong>Note:</strong> A game is considered as \"complete\" if the ball ends up with the player who started it.</p>\r\n\r\n<h2>Input Specification</h2>\r\n<p><strong>input1:</strong> An integer value N, representing the number of players.</p>\r\n<p><strong>input2:</strong> An integer value P, representing the player who starts the game.</p>\r\n<p><strong>input3:</strong> An integer value X, representing the maximum number of moves allowed to pass the ball.</p>\r\n\r\n<h2>Output Specification</h2>\r\n<p>Return an integer value representing the number of possible ways to complete the game.</p>\r\n\r\n<pre><code class='language-javascript'>int passTheBall(int input1,int input2,int input3)\r\n{\r\n    // Read only region end\r\n    // Write code and remove the below exception.\r\n    throw \"Function passTheBall(int input1,int input2,int input3) not implemented.\";\r\n}</code></pre>",
        "google_doc_link": null,
        "solution_code": null,
        "pregiven_code": "p\n#include <iostream>\n#include <vector>\n#include <string>\n#include <numeric>\n#include <algorithm>\n\nclass Solution {\npublic:\n    /**\n     * @param N An integer value representing the number of players.\n     * @param P An integer value representing the player who starts the game.\n     * @param X An integer value representing the maximum number of moves allowed to pass the ball.\n     * @return An integer value representing the number of possible ways to complete the game.\n     */\n    int passTheBall(int N, int P, int X) {\n        // Write your code here\n        return 0;\n    }\n};\n\nint main() {\n    std::ios_base::sync_with_stdio(false);\n    std::cin.tie(NULL);\n    int N, P, X;\n    std::cin >> N >> P >> X;\n    Solution solution;\n    int result = solution.passTheBall(N, P, X);\n    std::cout << result << std::endl;\n    return 0;\n}",
        "input_test_case": null,
        "output_test_case": null,
        "company_name": "Ola",
        "company_id": 578
    }
]