[
    {
        "id": 290,
        "title": "Signal Strength Network Problem",
        "problem_statement": "<div class=\\\"problem-container\\\">\n    <h2>Signal Strength Network Problem</h2>\n    \n    <div class=\\\"problem-description\\\">\n        <p>The current selected programming language is C++14. We emphasize the submission of a fully working code over partially correct but efficient code. Once submitted, you cannot review this problem again. You can use cout to debug your code. The code may not work in case of syntax/runtime error. The version of GCC being used is 5.5.0</p>\n        \n        <p>An organization has assigned X engineers to work on a project. The engineers need a way to connect with each other and share data. Austin, the network administrator, has built a hierarchical network that allows an engineer to connect to two engineers at most in the network. He establishes all full duplex connections in the network (i.e if there is a connection between A and B, then data can be transferred from A to B and B to A). The strength of the signal decreases by one unit upon each transmission between directly connected engineers. Therefore, Austin needs to determine the minimum strength at which the signal must be sent so that it will reach everyone.</p>\n    </div>\n    \n    <div class=\\\"input-format\\\">\n        <h3>Input</h3>\n        <p>The input consists of a string <code>inputString</code> representing the network in a level-order manner such that the character at indices 2*i+1 and 2*i+2 are the children of the character at index i.</p>\n    </div>\n    \n    <div class=\\\"output-format\\\">\n        <h3>Output</h3>\n        <p>Print N non-negative integers representing the minimum signal strength at which each engineer sent the data in a level-order manner.</p>\n    </div>\n    \n    <div class=\\\"notes\\\">\n        <h3>Note</h3>\n        <ul>\n            <li>An engineer is represented by 1 in the input string.</li>\n            <li>If any engineer does not connect with any other engineer, then 0 would be present at its children node positions to represent a null child.</li>\n        </ul>\n    </div>\n    \n    <div class=\\\"constraints\\\">\n        <h3>Constraints</h3>\n        <ul>\n            <li>0 < len < 1000; where len represents the length of the given string</li>\n        </ul>\n    </div>\n    \n    <div class=\\\"examples\\\">\n        <h3>Example</h3>\n        <div class=\\\"example\\\">\n            <pre class=\\\"input\\\">Input:\n11111000001000</pre>\n            <pre class=\\\"output\\\">Output:\n3 2 4 3 3 4</pre>\n            <div class=\\\"explanation\\\">\n                <p>For the input string S = 11111000001000, the network can be represented as:</p>\n                <pre>\n    1(A)\n    /  \\\\\n1(B)    1(C)\n/  \\\\\n1(D)  1(E)\n      \\\\\n      1(F)\n                </pre>\n                <p>The farthest node from node A is F. So, the minimum signal strength at which node A must send the signal is 3.</p>\n                <p>The farthest node from node B is F and C, and the farthest node from C is F. So, the minimum signal strength at which nodes B and C must send the signal is 2 and 4, respectively.</p>\n                <p>The farthest node from node D and E is C. So, the minimum signal strength for both D and E is 3.</p>\n                <p>Similarly, the node F is farthest from C. So, F must send a signal with minimum strength of 4.</p>\n                <p>So, the output is [3, 2, 4, 3, 3, 4].</p>\n            </div>\n        </div>\n    </div>\n</div>",
        "google_doc_link": "https://docs.google.com/document/d/1Co-zU6IPVgZxVwATOoUlqy6VKfa3zs7RYw8_JESYdU8/edit?usp=sharing",
        "solution_code": "",
        "company_name": "Barclays ",
        "company_id": 84
    }
]