[
    {
        "id": 478,
        "title": "Classroom Seating Arrangement",
        "problem_statement": "<div class=\\\"problem-container\\\">\n    <div class=\\\"problem-title\\\">\n        <h2>Classroom Seating Arrangement</h2>\n    </div>\n\n    <div class=\\\"problem-description\\\">\n        <p>In a classroom, there are N seats numbered 1 to N, and N students are present. Each student, starting from student 1, has a preferred seat represented in an array A. The students enter the classroom one by one and attempt to sit in their preferred seats. If their preferred seat is already occupied, they begin searching for the next available seat in a circular manner.</p>\n\n        <p>Your task is to find and return an integer array representing the order in which the seats will get occupied according to their attempts to sit in their preferred seat.</p>\n\n        <div class=\\\"note\\\">\n            <h4>Note:</h4>\n            <ul>\n                <li>Initially all the seats are empty.</li>\n                <li>\\\"Circular\\\" means that if a student\\'s preferred seat is already occupied, they start traversing the seats for the next available seat till the N<sup>th</sup> seat and then loop around to the beginning of the seating arrangement.</li>\n            </ul>\n        </div>\n    </div>\n\n    <div class=\\\"input-format\\\">\n        <h3>Input Format</h3>\n        <ul>\n            <li><strong>input1</strong>: An integer value N, representing the total number of seats present.</li>\n            <li><strong>input2</strong>: An integer array A, representing preferred seats of students.</li>\n        </ul>\n    </div>\n\n    <div class=\\\"output-format\\\">\n        <h3>Output Format</h3>\n        <p>Return an integer array representing the order in which the seats will get occupied according to their attempts to sit in their preferred seats.</p>\n    </div>\n\n    <div class=\\\"examples\\\">\n        <h3>Examples</h3>\n        \n        <div class=\\\"example\\\">\n            <h4>Example 1:</h4>\n            <pre class=\\\"input\\\">input1: 3\ninput2: {3,2,2}</pre>\n            <pre class=\\\"output\\\">{3,2,1}</pre>\n            <div class=\\\"explanation\\\">\n                <p>Given an array with 3 students and their preferred seats {3,2,2}, we can find the final arrangement in the following way:</p>\n                <p>Initially, all the seats are empty: {0,0,0}.</p>\n                <ul>\n                    <li>The first student wants seat number 3, which is vacant. They occupy it, resulting in: {3,0,0}.</li>\n                    <li>The second student wants seat number 2, which is vacant. They occupy it, resulting in {3,2,0}.</li>\n                    <li>The third student wants seat number 2, but it is occupied. They search in a circular manner and find seat number 1 vacant. They occupy it, resulting in the final seating arrangement: {3,2,1}.</li>\n                </ul>\n                <p>Hence, {3,2,1} is returned as the output.</p>\n            </div>\n        </div>\n\n        <div class=\\\"example\\\">\n            <h4>Example 2:</h4>\n            <pre class=\\\"input\\\">input1: 2\ninput2: {2,2}</pre>\n            <pre class=\\\"output\\\">{2,1}</pre>\n            <div class=\\\"explanation\\\">\n                <p>Given an array with 2 students and their preferred seats {2,2}, we can find the final arrangement in the following way:</p>\n                <p>Initially, all the seats are empty {0,0}.</p>\n                <ul>\n                    <li>The first student arrives, and their preferred seat is seat number 2. Since it is vacant, they occupy it. The seating arrangement becomes {2,0}.</li>\n                    <li>The second student wants seat number 2, but it is occupied. They search in a circular manner and find seat number 1 vacant. They occupy it, resulting in the final arrangement {2,1}.</li>\n                </ul>\n            </div>\n        </div>\n    </div>\n</div>",
        "google_doc_link": "https://docs.google.com/document/d/1JCoE1RULkRe8wzpr1_oSO6tVGeUKhkEG9O1LyjxIkdc/edit?usp=sharing",
        "solution_code": "",
        "company_name": "RedDoorz",
        "company_id": 142
    },
    {
        "id": 479,
        "title": "Robo Race",
        "problem_statement": "<div class=\\\"problem-container\\\">\n    <div class=\\\"problem-title\\\">\n        <h2>Robo Race</h2>\n    </div>\n\n    <div class=\\\"problem-description\\\">\n        <p>There is a robot race which two robots named Robotop and Robocop are going to run. Both robots will begin from the same starting point on a circular track. The race starts at time T = 0 seconds. Robotop starts the race at T = X<sup>th</sup> second and takes exactly N seconds to complete one lap, while Robocop starts the race at T = Y<sup>th</sup> second and takes exactly M seconds to complete one lap.</p>\n\n        <p>Your task is to find and return an integer value representing the least time T (in seconds) at which these two robots meet each other again at the starting point.</p>\n\n        <div class=\\\"note\\\">\n            <h4>Note:</h4>\n            <ul>\n                <li>Assume N and M to be co-prime positive integers.</li>\n                <li>Co-prime numbers are those numbers that have only 1 as common factor, e.g. 3 and 5 are co-prime numbers.</li>\n                <li>The time is only considered in seconds.</li>\n                <li>A lap is defined as a complete trip around a race track that is repeated several times during a competition.</li>\n            </ul>\n        </div>\n    </div>\n\n    <div class=\\\"input-format\\\">\n        <h3>Input Format</h3>\n        <ul>\n            <li><strong>input1</strong>: An integer value X, representing the time at which Robotop starts the race.</li>\n            <li><strong>input2</strong>: An integer value N, representing the time taken by Robotop to complete a lap.</li>\n            <li><strong>input3</strong>: An integer value Y, representing the time at which Robocop starts the race.</li>\n            <li><strong>input4</strong>: An integer value M, representing the time taken by Robocop to complete a lap.</li>\n        </ul>\n    </div>\n\n    <div class=\\\"output-format\\\">\n        <h3>Output Format</h3>\n        <p>Return an integer value representing the least time T (in seconds) at which these two robots meet each other again at the starting point.</p>\n    </div>\n\n    <div class=\\\"examples\\\">\n        <h3>Examples</h3>\n        \n        <div class=\\\"example\\\">\n            <h4>Example 1:</h4>\n            <pre class=\\\"input\\\">input1: 6\ninput2: 3\ninput3: 7\ninput4: 4</pre>\n            <pre class=\\\"output\\\">15</pre>\n            <div class=\\\"explanation\\\">\n                <p>Here in this example, Robotop starts the race at the 6<sup>th</sup> second and finishes a lap in 3 seconds while Robocop starts the race at the 7<sup>th</sup> second and finishes a lap in 4 seconds.</p>\n                <ul>\n                    <li>Robotop will be at the starting point at the following times: 9, 12, 15, 18... secs</li>\n                    <li>and Robocop will be at the starting point at the following times: 11, 15, 19, 23... secs</li>\n                </ul>\n                <p>Therefore, the least time T at which these two robots meet each other again at the starting point is 15 seconds. Hence, 15 is returned as the output.</p>\n            </div>\n        </div>\n\n        <div class=\\\"example\\\">\n            <h4>Example 2:</h4>\n            <pre class=\\\"input\\\">input1: 3\ninput2: 3\ninput3: 10\ninput4: 1</pre>\n            <pre class=\\\"output\\\">12</pre>\n            <div class=\\\"explanation\\\">\n                <p>Here in this example, Robotop starts the race at 3<sup>rd</sup> second and finishes a lap in 3 seconds while Robocop starts the race at 10<sup>th</sup> second and finishes a lap in 1 second.</p>\n                <ul>\n                    <li>Robotop will be at the starting point at the following times: 6, 9, 12, 15, ... secs</li>\n                    <li>and Robocop will be at the starting point at the following times: 11, 12, 13, 14, ... secs</li>\n                </ul>\n                <p>Therefore, they meet at 12 seconds.</p>\n            </div>\n        </div>\n    </div>\n</div>",
        "google_doc_link": "https://docs.google.com/document/d/10gWfKk-AWRUso7Dxtu-BQaQfRW0hZN4aFfHTfN_1h2o/edit?usp=sharing",
        "solution_code": "",
        "company_name": "RedDoorz",
        "company_id": 142
    }
]