[
    {
        "id": 741,
        "title": "Count Special Numbers",
        "problem_statement": "<h1>Count Special Numbers</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Philip is taking a surprise test. The problem in the test includes a range of integers from 1 to N (inclusive) where the candidates need to find the count of the Special Numbers in the range. The teacher describes Special Numbers as numbers that cannot be written in the form of c<sup>d</sup>, where c and d are positive integers greater than 1.</p>\r\n<p>Your task is to help Philip to find and return a string value representing the count of Special Numbers in the given range of 1 to N.</p>\r\n\r\n<h3>Input Specification:</h3>\r\n<p><strong>input1:</strong> A string value N, representing the upper limit of the range of numbers that needs to be checked for Special Numbers.</p>\r\n\r\n<h3>Output Specification:</h3>\r\n<p>Return a string representing the count of Special Numbers in the given range of 1 to N.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: input1 = 8\r\nOutput: 6</code></pre>\r\n<p><strong>Explanation:</strong> Here we have a range of numbers from 1 to 8, and we can count the Special Numbers in the following way:</p>\r\n<ul>\r\n    <li>In the given range, the number 4 can be represented as 2<sup>2</sup>, so it is not a Special Number.</li>\r\n    <li>Similarly, the number 8 can be represented as 2<sup>3</sup>, so it is also not a Special Number.</li>\r\n</ul>\r\n<p>As the remaining numbers 1, 2, 3, 5, 6, 7 cannot be represented in the form of c<sup>d</sup>, these numbers are categorized as Special Numbers. Since the count of Special Numbers in the range 1 to 8 is 6, 6 is returned as the output.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input: input1 = 11\r\nOutput: 8</code></pre>\r\n<p><strong>Explanation:</strong> Here we have a range of numbers from 1 to 11, and we can count the Special Numbers in the following way:</p>\r\n<ul>\r\n    <li>In the given range, the number 4 can be represented as 2<sup>2</sup>, so it is not a Special Number.</li>\r\n    <li>Similarly, the number 8 can be represented as 2<sup>3</sup>, so it is not a Special Number.</li>\r\n    <li>Similarly, the number 9 can be represented as 3<sup>2</sup>, so it is not a Special Number.</li>\r\n</ul>\r\n<p>As the remaining numbers 1, 2, 3, 5, 6, 7, 10, 11 cannot be represented in the form of c<sup>d</sup>, these numbers are categorized as Special Numbers. Since the count of Special Numbers in the range 1 to 11 is 8, 8 is returned as the output.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Virtusa_24july",
        "company_id": 234
    }
]