[
    {
        "id": 898,
        "title": "Maximum People in Party Hall",
        "problem_statement": "<h1>Maximum People in Party Hall</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>In party hall, security guard is given job of noting down the time at which people enter and leave the party hall. At any point of the day he wonders what the maximum number of people in the party hall during the event. For simplicity he assumes time as a single integer and counts minutes from the start of the party at which person entered and left the party. At any point of time, only a single person can enter or exit the party but not both.</p>\r\n<p>For e.g. consider following timings noted down by security guard</p>\r\n<pre><code class='language-text'>Serial Number | Enters at | Leaves at\r\n--------------|-----------|----------\r\n1             | 1         | 7\r\n2             | 2         | 4\r\n3             | 3         | 9\r\n4             | 3         | 8\r\n5             | 5         | 10</code></pre>\r\n<p>Each person is represented with an integer for simplicity. Each row denotes the entry time and exit time for one person. In this example maximum number of people in the party hall was 4. This was between time 6 and 7. Your task is to write a program that will read list of entry and exit times and compute maximum number of people at any point of time during the event.</p>\r\n\r\n<h2>Input</h2>\r\n<p>The first line contains a single integer N, (1 <= N <= 100), the number of entries and exits are recorded. This is followed by N lines where each line contains two integers, separated by space describing entry and exit time of that person. The entry and exit times are distinct and entry time will be less than exit time. The constraint on entry and exit times is 1000000.</p>\r\n\r\n<h2>Output</h2>\r\n<p>Output a single integer, denoting maximum number of people during the event.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n5\r\n1 7\r\n2 4\r\n3 9\r\n3 8\r\n5 10\r\nOutput:\r\n4</code></pre>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>1 <= N <= 100</li>\r\n    <li>Entry and exit times are distinct.</li>\r\n    <li>Entry time will be less than exit time.</li>\r\n    <li>Entry and exit times are up to 1,000,000.</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Nvidia_30may",
        "company_id": 276
    }
]