[
    {
        "id": 902,
        "title": "Merge Number Chains",
        "problem_statement": "<h1>Merge Number Chains</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Tom and Bob love to play with Number chains. Both of them got their own Number chains which consist of numbers. One day Tom got a crazy idea to merge one of his Number chain with Bob's Number chain and challenged Bob to identify the merging point of the two chains with blind folds and add the smaller chain before the merge point at the end of larger chain. Bob being a tech enthusiast accepted the challenge and decided to find the merging point and add the smaller chain to the larger chain, but he can't see anything due to the blind fold. Can you help Bob to find the merging point of two number chains and append the smaller chain to the larger chain?</p>\r\n<p>Given the function <code>Node findchain(Node Chain1, Node Chain2)</code>, where <code>Chain1</code> and <code>Chain2</code> are two linked lists of integers. The function should return a single linked list such that it contains the smaller chain before the merge point appended to the larger chain as described in examples. If both chains are of same length then append Chain1 after Chain2.</p>\r\n<p>Please consider writing optimized code. You can directly start writing the code in the provided function named 'findchain'.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\nChain1: 1 -> 2 -> 3 -> (Merge Point)\r\nChain2: 78 -> 33 -> (Merge Point)\r\nMerged Tail: 99 -> 45 -> 56\r\n\r\nOutput: 1-2-3-99-45-56-78-33</code></pre>\r\n<p><strong>Explanation:</strong> The smaller chain before the merge point 99 is the chain2, so we merged chain 2 at the end of chain 1.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\nChain1: 0 -> -23 -> 90 -> (Merge Point)\r\nChain2: 89 -> 78 -> 33 -> (Merge Point)\r\nMerged Tail: 80 -> 4 -> 3\r\n\r\nOutput: 0--23-90-89-78-33-80-4-3</code></pre>\r\n<p><strong>Explanation:</strong> The smaller chain before the merge point 80 is the chain1, so we merged chain 1 at the end of chain 2.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li><code>0 <= Length of linked list <= 100000</code></li>\r\n    <li><code>-1000000000 <= integer value in linked list <= 1000000000</code></li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Tech Mahindra_",
        "company_id": 279
    }
]