[
    {
        "id": 964,
        "title": "City Travel Rewards",
        "problem_statement": "<h1>City Travel Rewards</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Jack lives in a city that has A tourist places and M roads connecting them. All the roads in the city are <strong>one-way</strong> (i.e., directed roads). As a result, some tourist places may become isolated and abandoned. Two tourist places may have multiple direct roads connecting them.</p>\r\n<p>The city authorities have decided to launch a loyalty program to attract tourists. In this loyalty program, a person will receive rewards when traveling through roads. Each road has a fixed base reward point. When a person travels through a road for the i-th time, with a base reward point of Z, they will receive a reward calculated using the formula B + (i-1)^2 * Z. If the reward comes out to be negative according to this formula, the reward will be set to zero.</p>\r\n<p>Jack wants to know the maximum reward points he can accumulate using this loyalty program. Since Jack is busy, he asks you to find it for him.</p>\r\n<p>You are given integers A and B, where A represents the number of tourist places, and B represents Jack's starting place. You also have a 2D array C of size M by 3, where C[i][0] and C[i][1] respectively represent the starting and ending tourist places of the i-th one-way road, and C[i][2] represents the base reward point of the i-th road.</p>\r\n<p><strong>Note:</strong><br>There may be roads that lead from a tourist place back to itself.</p>\r\n\r\n<h2>Input Format</h2>\r\n<p>First argument contains an integer A.<br>Second argument contains an integer B.<br>Third argument contains a 2D integer array C.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>Return an integer denoting the required answer.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\nA = 3\r\nB = 1\r\nC = [[1, 2, 1], [2, 3, 4], [3, 1, 0]]\r\nOutput:\r\n9</code></pre>\r\n<p><strong>Explanation:</strong><br>For Input 1:<br>Jack travels from tourist place 1 to tourist place 2 and gets 1 reward point.<br>He then travels from tourist place 2 to tourist place 3 and gets 4 reward points.<br>He repeats the same routes for the second and third time, earning rewards as follows:<br>Tourist place 1 to tourist place 2: 0 reward points (2nd time), 0 reward points (3rd time).<br>Tourist place 2 to tourist place 3: 5 reward points (2nd time), 8 reward points (3rd time).<br>Tourist place 3 to tourist place 1: 1 reward points (2nd time), 4 reward points (3rd time).<br>Tourist place 3 to tourist place 3: 0 reward points (2nd time), 0 reward points (3rd time).<br>The total reward points Jack accumulates are (1 + 0 + 0) + (4 + 5 + 8) + (0 + 1 + 4) = 9.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\nA = 1\r\nB = 1\r\nC = [[1, 2, 1], [2, 3, 4]]\r\nOutput:\r\n5</code></pre>\r\n<p><strong>Explanation:</strong><br>For Input 2:<br>Jack travels from tourist place 1 to tourist place 2 and receives 1 reward points.<br>He then travels from tourist place 2 to tourist place 3 and earns 4 reward points.<br>As there are no further connections from tourist place 3, Jack cannot continue his journey to other tourist places.<br>Therefore, the total reward points that Jack accumulates are (1 + 4) = 5.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>1 &lt;= A &lt;= 10^5</li>\r\n    <li>0 &lt;= M &lt;= 10^5</li>\r\n    <li>1 &lt;= B &lt;= A</li>\r\n    <li>1 &lt;= C[i][0], C[i][1] &lt;= A</li>\r\n    <li>0 &lt;= C[i][2] &lt;= 10^5</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Makemytrip_26july",
        "company_id": 307
    }
]