[
    {
        "id": 970,
        "title": "Matrix Operations",
        "problem_statement": "<h1>Matrix Operations</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Consider a square matrix of size M x M, perform the following operation on the matrix, and print the final resultant matrix.</p>\r\n<ol>\r\n    <li><strong>Step 1:</strong> Arrange the first-row elements in ascending order from left to right, and the second-row elements in descending order from left to right. Continue this loop for all the M rows of the matrix.</li>\r\n    <li><strong>Step 2:</strong> Arrange the first-column elements in ascending order from top to bottom and the second-column elements in ascending order from top to bottom. Continue this loop for all the M columns of the matrix.</li>\r\n    <li><strong>Step 3:</strong> Print the final matrix after all the operations.</li>\r\n</ol>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not write arbitrary strings while reading the input or while printing, as these contribute to the standard output.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>The matrix must be always square</li>\r\n    <li>The size of the square matrix must be less than 100</li>\r\n</ul>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first line of input contains M, the size of the matrix.</p>\r\n<p>The next M lines contains the M integers in each line which are the inputs for the matrix and a space separates each number.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>The output should display the M x M matrix where M numbers are printed in each row and include a space after each element.</p>\r\n<p>If the result is</p>\r\n<pre><code class='language-text'>a1 a2\r\na3 a4</code></pre>\r\n<p>then the output must be</p>\r\n<pre><code class='language-text'>a1&lt;space&gt;a2&lt;space&gt;\r\na3&lt;space&gt;a4&lt;space&gt;</code></pre>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n3\r\n1 2 3\r\n4 5 6\r\n7 8 9\r\nOutput:\r\n1 2 3\r\n6 5 4\r\n7 8 9</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>Original matrix is</p>\r\n<pre><code class='language-text'>3 2 1\r\n4 5 6\r\n7 8 9</code></pre>\r\n<p>After step 1 the result is</p>\r\n<pre><code class='language-text'>1 2 3\r\n6 5 4\r\n7 8 9</code></pre>\r\n<p>After step 2 the result is</p>\r\n<pre><code class='language-text'>1 2 3\r\n6 5 4\r\n1 8 3</code></pre>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n2\r\n4 6\r\n9 8\r\nOutput:\r\n4 6\r\n8 9</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>Original matrix is</p>\r\n<pre><code class='language-text'>4 6\r\n9 8</code></pre>\r\n<p>Matrix after decryption</p>\r\n<pre><code class='language-text'>4 6\r\n8 9</code></pre>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Texas_26july",
        "company_id": 311
    },
    {
        "id": 971,
        "title": "Share Value Decision",
        "problem_statement": "<h1>Share Value Decision</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Jasmine has a unique strategy for buying shares online. Every day she randomly selects N companies and checks their current share value array (where N is the number of companies). She is only interested in buying shares whose value remains unchanged when the share is read from right to left.</p>\r\n<p>Jasmine needs an automated program that can take the prices of N stocks as input and determine if they meet her criteria. If a stock meets her criteria, the program should output \"YES\", otherwise, it should output \"NO\". Can you help her by creating this program? Jasmine is also not interested in purchasing the shares that are in loss, which are indicated with \"-\"ve sign before share value.</p>\r\n<p>Read the input from STDIN and print the output to STDOUT. Do not write arbitrary strings or prompts in the program, as these contribute to the standard output, and test cases will fail.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>1 &lt;= N &lt;= 2000, number of companies Jasmine selected for that day.</li>\r\n    <li>-2^31 &lt;= X &lt;= 2^31 (X is prefixed with the \"-\"ve sign if the share is in loss)</li>\r\n    <li>X is always integer</li>\r\n</ul>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first input line has N, the number of companies she selected for that day.</p>\r\n<p>The next N line contains the share values of N different companies.</p>\r\n\r\n<h2>Output Format</h2>\r\n<p>The output should display in the N lines. Print \"YES\" if the share value follows her rules else print \"NO\".</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\n2\r\n313\r\n-11\r\nOutput:\r\nNO</code></pre>\r\n<p><strong>Explanation:</strong> In Given 2 companies,<br>First company's share value is 313 when read from right to left still remains 313 so it should be \"YES\" so \"YES\" is printed in the first line as she is interested in buying that share.<br>Second company's share value is -11 when read from right to left still remains -11 but -ve indicated loss so she is not interested in buying it so \"NO\" is printed.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\n2\r\n12\r\n22\r\nOutput:\r\nNO\r\nYES</code></pre>\r\n<p><strong>Explanation:</strong> In Given 2 companies,<br>First company's share value is 12 when read from right to left it becomes 21. So \"NO\" is printed in the first line.<br>Second company's share value is 22 when read from right to left still remains 22. So \"YES\" is printed in the second line.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Texas_26july",
        "company_id": 311
    }
]