[
    {
        "id": 1013,
        "title": "Variable Market",
        "problem_statement": "<h1>Variable Market</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>There is a rush for crypto stocks in the variable markets and there is a pipeline for buying stock. Total requested amount of N persons is put in the pipeline, sequence wisem i.e., the 1st person with their request amount, then the 2nd person with their request amount, etc. You are given fixed tax charges for stock buying. For the first transaction, the tax amount is K and for the next transaction, it is K+Y, then K+2Y, 3Y, so on.</p>\r\n<p>The first amount in the pipeline is used first for buying the crypto stock.</p>\r\n<p>The following process is followed for the first amount in the pipeline:</p>\r\n<ul>\r\n    <li>The (i+1)th element and the (i+2)th element are compared.</li>\r\n    <li>If the (i+1)th element is greater than the (i+1)th element, swap both values.</li>\r\n    <li>The elements are compared from the front to the back, i.e., left to right.</li>\r\n    <li>The process of buying the 1st requested amount ends after all elements are compared.</li>\r\n    <li>The next element is considered the first amount or front, and the process continues until the pipeline is empty.</li>\r\n</ul>\r\n<p>Calculate the amount of tax payment for each person.</p>\r\n\r\n<h2>Function Description</h2>\r\n<p>In the provided code snippet, implement the provided <code>variableMarket(...)</code> method to calculate the amount of tax payment for each person. You can write your code in the space below the phrase \"WRITE YOUR LOGIC HERE\".</p>\r\n<p>There will be multiple test cases running so the input and output should match exactly as provided. The base Output variable <code>result</code> is set to a default value of -404 which can be modified. Additionally, you can add or remove these output variables.</p>\r\n\r\n<h2>Input Format</h2>\r\n<p>The first line contains 3 space-separated integers, N, K, and Y, denoting the total number of people, the fixed tax charges for stock buying, and the variable tax charges, respectively.</p>\r\n<p>The second line contains N space-separated integers of array A, denoting the requested amount of all N persons.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: 5 5 2\r\n2 3 4 1 5\r\nOutput: 5 11 7 13 9</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>A = [2 3 4 1 5]</p>\r\n<p>K = 5</p>\r\n<p>Y = 2</p>\r\n<p>The 1st person asked for the amount of 2 and his amount is in front of the pipeline.</p>\r\n<p>It is bought at tax amount K, i.e., 5.</p>\r\n<p>When buying is in the process, the 2nd index and the 3rd index are compared, i.e., the value 3 is less than 4; we swap both values.</p>\r\n<p>A becomes [2 4 3 1 5].</p>\r\n<p>The 3rd and 4th indexes are compared, i.e., 3 is greater than 1; there's no need to swap.</p>\r\n<p>A becomes [2 4 3 1 5].</p>\r\n<p>The 4th and 5th indexes are compared, i.e., 1 is less than 5; the values are swapped.</p>\r\n<p>A becomes [2 4 3 5 1].</p>\r\n<p>All elements are compared from left to right; the first element, i.e., 2, is deleted.</p>\r\n<p>A becomes [4 3 5 1].</p>\r\n<p>The amount of 4 is considered as the first element or the front, and the tax amount is K + Y = 5 + 2 = 7.</p>\r\n<p>All the elements get compared from left to right, and the first element, i.e., 4, is deleted.</p>\r\n<p>A becomes [3 5 1].</p>\r\n<p>The amount of 5 is considered as the first element or the front, and the tax amount is K + 2Y = 5 + 4 = 9.</p>\r\n<p>All the elements get compared from left to right, and the first element, i.e., 5, is deleted.</p>\r\n<p>A becomes [3 1].</p>\r\n<p>The amount of 3 is considered as the first element or the front, and the tax amount is K + 3Y = 5 + 6 = 11.</p>\r\n<p>All the elements get compared from left to right, and the first element, i.e., 3, is deleted.</p>\r\n<p>A becomes [1].</p>\r\n<p>The amount of 1 is considered as the first element or the front, and the tax amount is K + 4Y = 5 + 8 = 13.</p>\r\n<p>No elements are present to get compared from left to right; the first element, i.e., 1, is deleted.</p>\r\n<p>A becomes [].</p>\r\n<p>The tax payments are [5, 7, 9, 11, 13].</p>\r\n<p>The tax payments are arranged in the original order of A, i.e., 5 11 7 13 9.</p>\r\n<p>Hence, the output is 5 11 7 13 9.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>1 &lt;= N &lt;= 100000</li>\r\n    <li>1 &lt;= K &lt;= 10000</li>\r\n    <li>1 &lt;= Y &lt;= 1000</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "Grow_2july",
        "company_id": 325
    }
]