[
    {
        "id": 1280,
        "title": "Warehouse of Automobile Factory",
        "problem_statement": "<h1>Warehouse of Automobile Factory</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>You are working in the warehouse of an automobile company and are required to sell automobile parts in the wholesale market.</p>\r\n<p>You are given two arrays -</p>\r\n<ol>\r\n    <li><code>UniqueId[]</code> of size N denoting the unique id of each automobile part.</li>\r\n    <li><code>Profit[]</code> of size N denoting the profit that can be earned by selling each part.</li>\r\n</ol>\r\n<p>Your task is to return the maximum profit that can be earned by selling the automobile parts in the market.</p>\r\n<p><strong>Note:</strong> If two or more consecutive parts in the array <code>UniqueId[]</code> have the same id, then only the one amongst them with the maximum profit can be sold.</p>\r\n\r\n<h3>Input Specification:</h3>\r\n<ul>\r\n    <li><strong>input1:</strong> An array of integers denoting the Unique Ids of the automobile parts.</li>\r\n    <li><strong>input2:</strong> An array of integers denoting the profit that can be earned per part.</li>\r\n    <li><strong>input3:</strong> An integer N denoting the length of the arrays.</li>\r\n</ul>\r\n\r\n<h3>Output Specification:</h3>\r\n<p>Return an integer denoting the maximum total profit that can be earned by selling automobile parts.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input:\r\ninput1 = [4,6,3,3,4]\r\ninput2 = [-1,10,10,15,-5]\r\ninput3 = 5\r\nOutput: 25</code></pre>\r\n<p><strong>Explanation:</strong> We can sell the 2nd and 4th items and earn a total profit of 10 + 15 = 25. This is the maximum possible profit that we can earn. Note that we cannot sell both the 3rd and 4th items as they have the same unique id. Hence, 25 will be returned as the output.</p>\r\n\r\n<h3>Example 2:</h3>\r\n<pre><code class='language-text'>Input:\r\ninput1 = [1,2,1]\r\ninput2 = [10,20,30]\r\ninput3 = 3\r\nOutput: 60</code></pre>\r\n<p><strong>Explanation:</strong> We can sell all the 3 items and earn a total profit of 10 + 20 + 30 = 60. This is the maximum possible profit that we can earn. Note that we can sell the 1st and 3rd items having the same UniqueId as they are not consecutive. Hence, 60 will be returned as the output.</p>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "ZS_21aug",
        "company_id": 438
    }
]