[
    {
        "id": 1546,
        "title": "Maximum Coins in Airplane Game",
        "problem_statement": "<h1>Maximum Coins in Airplane Game</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>This problem describes a game played on a grid-based map where an airplane collects coins and avoids enemies to maximize its score.</p>\r\n\r\n<h3>Game Setup:</h3>\r\n<ul>\r\n    <li>The game map has a fixed width of 5 columns. Its height, N, varies per test case.</li>\r\n    <li>A <strong>Game Zone</strong>, a 5x5 black rectangle, displays a portion of the larger game map.</li>\r\n    <li>A <strong>Control Zone</strong>, a blue rectangle, is a single line at the bottom of the Game Zone where the airplane moves.</li>\r\n    <li>The map contains <strong>Coins</strong> (marked 'C' or represented by '1' in input) and <strong>Enemies</strong> (marked 'R' or represented by '2' in input). Empty spaces are '0'.</li>\r\n    <li>The airplane starts at the center column (column index 2) of the Control Zone.</li>\r\n    <li>The initial number of gathered coins is 0.</li>\r\n</ul>\r\n\r\n<h3>Gameplay Rules:</h3>\r\n<p>Each turn consists of the following phases:</p>\r\n\r\n<ol>\r\n    <li>\r\n        <strong>Airplane Movement (Optional Bomb Usage):</strong>\r\n        <p>Before the airplane moves, a bomb can optionally be used. A bomb can be used only once during the entire gameplay. If used, it eliminates all enemies within the current 5x5 Game Zone. It cannot eliminate enemies outside this zone.</p>\r\n        <p>The airplane then makes one of three movements:</p>\r\n        <ul>\r\n            <li>Move one column to the left.</li>\r\n            <li>Move one column to the right.</li>\r\n            <li>Stay at the current position.</li>\r\n        </ul>\r\n        <p>The airplane can only move one column left or right per turn.</p>\r\n    </li>\r\n    <li>\r\n        <strong>Map Shift and Interaction:</strong>\r\n        <p>After the airplane moves, the entire game map (above the Control Zone) shifts down by one line. This means new elements from the map's height N will appear in the Game Zone.</p>\r\n        <p>The airplane then interacts with the cell it lands on in the Control Zone:</p>\r\n        <ul>\r\n            <li>If the airplane meets a <strong>Coin</strong>, the number of gathered coins increases by 1.</li>\r\n            <li>If the airplane meets an <strong>Enemy</strong>, the number of gathered coins decreases by 1.</li>\r\n        </ul>\r\n        <p>After interaction, all coins and enemies in the Control Zone disappear for the current turn.</p>\r\n    </li>\r\n    <li>\r\n        <strong>Game Over Condition:</strong>\r\n        <p>The game ends when the airplane reaches the end of the map (N turns) or if the number of gathered coins becomes -1. The airplane explodes if its coin count drops to -1 (e.g., meeting an enemy when having 0 coins).</p>\r\n    </li>\r\n</ol>\r\n\r\n<h3>Objective:</h3>\r\n<p>Given the height of the game map (N) and the arrangement of coins and enemies, find the maximum number of coins the airplane can gather by the end of the game. If it's impossible for the airplane to survive any path (i.e., it always explodes), output -1.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<p>Consider a game map with height N = 7, as illustrated in Fig. 2 (from the problem statement images). If the game proceeds as shown in the figure, the maximum number of coins attainable at the end of the game is 6. A bomb is used in the second turn to clear enemies.</p>\r\n<p><strong>Explanation:</strong> The example visually demonstrates how the airplane moves, collects coins, and uses a bomb strategically to achieve the maximum score of 6.</p>\r\n<pre><code class='language-text'>Input (Conceptual for N=7, based on Fig. 2):\r\nN = 7\r\nMap:\r\n... (rows representing the game map, 5 columns each)\r\n... (0 for empty, 1 for coin, 2 for enemy)\r\n...\r\nOutput: 6</code></pre>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>Time Limit: 5 seconds for C/C++/Java.</li>\r\n    <li>Number of test cases (T) is less than or equal to 50.</li>\r\n    <li>The height of the game map (N) is an integer such that 5 &le; N &le; 12.</li>\r\n    <li>The width of the game map is always 5.</li>\r\n    <li>At the start of the game, the airplane is located at the center column (column index 2) of the control zone.</li>\r\n    <li>The airplane can go one column further in each turn when moving left or right (e.g., from column 2 to 1 or 3).</li>\r\n    <li>A bomb can be used only once during the gameplay.</li>\r\n    <li>The initial number of coins is 0 when the game is started.</li>\r\n    <li>If the airplane with no coins meets an enemy, the number of coins becomes -1, and the plane explodes, ending the game.</li>\r\n</ul>\r\n\r\n<h2>Input</h2>\r\n<p>The input format is as follows:</p>\r\n<pre><code class='language-text'>T\r\nN_1\r\nmap_row_1_1\r\nmap_row_1_2\r\n...\r\nmap_row_1_N_1\r\nN_2\r\nmap_row_2_1\r\n...\r\nmap_row_2_N_2\r\n... (for T test cases)</code></pre>\r\n<ul>\r\n    <li>The first line contains an integer <strong>T</strong>, representing the number of test cases.</li>\r\n    <li>For each test case:\r\n        <ul>\r\n            <li>The first line contains an integer <strong>N</strong>, representing the height of the game map.</li>\r\n            <li>The following <strong>N</strong> lines describe the game map. Each line consists of 5 integers (separated by spaces) representing the columns of that row. These integers can be:\r\n                <ul>\r\n                    <li><strong>0</strong>: Represents an empty column.</li>\r\n                    <li><strong>1</strong>: Represents a coin.</li>\r\n                    <li><strong>2</strong>: Represents an enemy.</li>\r\n                </ul>\r\n            </li>\r\n        </ul>\r\n    </li>\r\n</ul>\r\n\r\n<h2>Output</h2>\r\n<p>For each test case, print a single integer:</p>\r\n<ul>\r\n    <li>The maximum number of coins that can be gathered.</li>\r\n    <li>If the airplane cannot survive in any possible way, print <strong>-1</strong>.</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "company_name": "samsung_29sep",
        "company_id": 542
    }
]