[
    {
        "id": 1966,
        "title": "Ant's Journey Home",
        "problem_statement": "<h1>Ant's Journey Home</h1>\r\n\r\n<h2>Problem Description</h2>\r\n<p>Once upon a time, in a forest, there lived a little ant named Andy. Andy's cozy anthill was located at a specific spot along the x-axis, a straight path that stretched through the forest. Andy's home was at position x, and he loved to explore the forest, often wandering far from home. However, as dusk fell, it was time for Andy to return to his snug little anthill.</p>\r\n\r\n<p>To find his way back, Andy had a unique way of traveling: He could march forward by exactly \"a\" positions or scurry backward by exactly \"b\" positions.</p>\r\n\r\n<p>However, there were a few rules and prohibitions on his journey:</p>\r\n<ul>\r\n    <li>Andy could not scurry backward twice in a row; it made him dizzy and confused.</li>\r\n    <li>Certain positions in the forest were marked as dangerous by large red flags. Andy knew he must avoid these prohibited spots at all costs.</li>\r\n    <li>Andy could not scurry to any position beyond the beginning of the forest, marked as position 0. He wasn't a fan of the dark, mysterious areas beyond this starting point.</li>\r\n</ul>\r\n\r\n<p>Given these conditions, Andy needed to find the quickest path back to his home. He could even march beyond his home if necessary, as long as he could navigate back to position x.</p>\r\n\r\n<p>Given an array of integers <code>prohibited[]</code>, where <code>prohibited[i]</code> means that Andy cannot jump to the position <code>prohibited[i]</code>, and another array <code>data</code> of size 3 specifies integers <code>a</code>, <code>b</code>, and <code>x</code> respectively. Return the least number of steps needed Andy to reach its home. If there is no possible sequence of jumps that lands Andy on position x, return -1.</p>\r\n\r\n<h2>Examples</h2>\r\n<h3>Example 1:</h3>\r\n<pre><code class='language-text'>Input: prohibited = [14, 4, 18, 1], data = [3,15,9]\r\nOutput: 3</code></pre>\r\n<p><strong>Explanation:</strong></p>\r\n<p>Andy the ant starts his journey from position 0 on the x-axis. His goal is to reach his home located at position 9. Andy has the ability to take step forward by 3 positions and backward by 15 positions. However, he cannot take step backward twice in a row and there are certain positions he must avoid because they are marked as dangerous.</p>\r\n<p>Here's how Andy can successfully reach his home:</p>\r\n<ul>\r\n    <li><strong>Initial Position:</strong> Andy begins at position 0.</li>\r\n    <li><strong>First Step:</strong> Andy moves forward by 3 positions. He moves from position 0 to position 3. So far, he took 1 step. Path so far: 0 -> 3</li>\r\n    <li><strong>Second Step:</strong> Andy moves forward again by 3 positions. He moves from position 3 to position 6. Now, he took a total of 2 steps. Path so far: 0 -> 3 -> 6</li>\r\n    <li><strong>Third Step:</strong> Andy took another forward step by 3 positions. He moves from position 6 to position 9. He took now a total of 3 steps. Path so far: 0 -> 3 -> 6 -> 9</li>\r\n</ul>\r\n<p>Andy successfully reaches his home at position 9 with a total of 3 forward jumps. Throughout his journey, he avoids all prohibited positions and follows the rule of not stepping backward consecutively.</p>\r\n<p>Therefore, the least number of steps required for Andy to reach his home is 3.</p>\r\n\r\n<h2>Constraints</h2>\r\n<ul>\r\n    <li>Andy cannot scurry backward twice in a row.</li>\r\n    <li>Andy cannot scurry to any position beyond position 0 (i.e., no negative positions).</li>\r\n    <li>Andy must avoid all positions listed in the <code>prohibited</code> array.</li>\r\n    <li>The <code>data</code> array will always be of size 3, containing <code>[a, b, x]</code>, where <code>a</code> is the forward step size, <code>b</code> is the backward step size, and <code>x</code> is the target home position.</li>\r\n    <li>If no possible sequence of jumps leads Andy to position <code>x</code>, return -1.</li>\r\n</ul>",
        "google_doc_link": null,
        "solution_code": null,
        "pregiven_code": null,
        "input_test_case": null,
        "output_test_case": null,
        "company_name": "Bounteous × Accolite_22oct",
        "company_id": 697
    }
]